Miao-T/coremark_MM32/bsp/bsp_tim.c
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM32_MB032) || defined(__MM32_MB033)
void BSP_TIM_CH3_GPIO_Configure(TIM_TypeDef* tim, bool remapEn, u8 remapIdx, bool inoutMode)
{
    switch (*(u32*)&tim) {
        case TIM1_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_10, NO_REMAP, GPIO_AF_1) :\
                GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_10, NO_REMAP, GPIO_AF_1);
        }
        else {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_6, NO_REMAP, GPIO_AF_4) :\
                GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_6, NO_REMAP, GPIO_AF_4);
        }
        break;
        case TIM3_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_0, NO_REMAP, GPIO_AF_4) :\
                GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_0, NO_REMAP, GPIO_AF_4);
        }
        else {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_0, NO_REMAP, GPIO_AF_4) :\
                GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_0, NO_REMAP, GPIO_AF_4);
        }
        break;
        default: break;
    }
}
#else
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_CH3_GPIO_Configure(TIM_TypeDef* tim, bool remapEn, u8 remapIdx, bool inoutMode)
{
    switch (*(u32*)&tim) {
#if defined(TIM1)
        case TIM1_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_10, NO_REMAP, GPIO_AF_2) :
                    	  GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_10, 	NO_REMAP, GPIO_AF_2);
        }
        else {
            if (remapIdx == 0) {
                GPIOA_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_10, EXTI_MAPR_TIM1_PARTIAL, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_10, 	EXTI_MAPR_TIM1_PARTIAL, GPIO_AF_2);
            }
        }
        break;
#endif
#if defined(TIM2)
        case TIM2_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_2, NO_REMAP, GPIO_AF_2) :
                          GPIO_Mode_FLOATING_Init(	 GPIOA, GPIO_Pin_2, NO_REMAP, GPIO_AF_2);
        }
        else {
            if (remapIdx == 0) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_2, EXTI_MAPR_TIM2_PARTIAL1, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOA, GPIO_Pin_2, EXTI_MAPR_TIM2_PARTIAL1, GPIO_AF_2);
            }
            if (remapIdx == 1) {
                GPIOA_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_10, EXTI_MAPR_TIM2_PARTIAL2, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_10, EXTI_MAPR_TIM2_PARTIAL2, GPIO_AF_2);
            }
            if (remapIdx == 2) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_10, EXTI_MAPR_TIM2, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_10, EXTI_MAPR_TIM2, GPIO_AF_2);
            }
        }
        break;
#endif
#if defined(TIM3)
        case TIM3_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_0, NO_REMAP, GPIO_AF_1) :
                          GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_0, NO_REMAP, GPIO_AF_1);
        }
        else {
            if (remapIdx == 0) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_0, EXTI_MAPR_TIM3_PARTIAL, GPIO_AF_1) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_0, EXTI_MAPR_TIM3_PARTIAL, GPIO_AF_1);
            }           
            if (remapIdx == 1) {
                GPIOC_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOC, GPIO_Pin_8, EXTI_MAPR_TIM3, GPIO_AF_1) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOC, GPIO_Pin_8, EXTI_MAPR_TIM3, GPIO_AF_1);
            }
        }
        break;
#endif
#if defined(TIM4)
        case TIM4_BASE:
        GPIOB_ClockEnable();
        (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_8, NO_REMAP, NO_FUNCAF) :
                	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_8, NO_REMAP, NO_FUNCAF);
        break;
#endif
#if defined(TIM8)
        case TIM8_BASE:
        if (!remapEn) {
            GPIOC_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOC, GPIO_Pin_8, NO_REMAP, GPIO_AF_3) :
                          GPIO_Mode_FLOATING_Init(	 GPIOC, GPIO_Pin_8, NO_REMAP, GPIO_AF_3);
        }
        else {
            if (remapIdx == 0) {
                GPIOC_ClockEnable();
                    (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOC, GPIO_Pin_2, NO_REMAP, GPIO_AF_6) :
                            	  GPIO_Mode_FLOATING_Init(   GPIOC, GPIO_Pin_2, NO_REMAP, GPIO_AF_6);
            }
        }
        break;
#endif
        default: break;
    }
}
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM32_MB032) || defined(__MM32_MB033)
void BSP_TIM_CH4_GPIO_Configure(TIM_TypeDef* tim, bool remapEn, u8 remapIdx, bool inoutMode)
{
    switch (*(u32*)&tim) {
        case TIM1_BASE:
        GPIOA_ClockEnable();
        (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_7, NO_REMAP, GPIO_AF_4) :\
            GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_7, NO_REMAP, GPIO_AF_4);
        break;
        default: break;
    }
}
#else
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_CH4_GPIO_Configure(TIM_TypeDef* tim, bool remapEn, u8 remapIdx, bool inoutMode)
{
    switch (*(u32*)&tim) {
        case TIM1_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_11, NO_REMAP, GPIO_AF_2) :
                    	  GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_11, 	NO_REMAP, GPIO_AF_2);
        }
        else {
            if (remapIdx == 0) {
                GPIOA_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_11, EXTI_MAPR_TIM1_PARTIAL, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(GPIOA, GPIO_Pin_11, 	EXTI_MAPR_TIM1_PARTIAL, GPIO_AF_2);
            }
        }
        break;
        case TIM2_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_3, NO_REMAP, GPIO_AF_2) :
                          GPIO_Mode_FLOATING_Init(	 GPIOA, GPIO_Pin_3, NO_REMAP, GPIO_AF_2);
        }
        else {
            if (remapIdx == 0) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_3, EXTI_MAPR_TIM2_PARTIAL1, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOA, GPIO_Pin_3, EXTI_MAPR_TIM2_PARTIAL1, GPIO_AF_2);
            }
            if (remapIdx == 1) {
                GPIOA_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_11, EXTI_MAPR_TIM2_PARTIAL2, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_11, EXTI_MAPR_TIM2_PARTIAL2, GPIO_AF_2);
            }
            if (remapIdx == 2) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_11, EXTI_MAPR_TIM2, GPIO_AF_2) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_11, EXTI_MAPR_TIM2, GPIO_AF_2);
            }
        }
        break;
        case TIM3_BASE:
        if (!remapEn) {
            GPIOA_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_1, NO_REMAP, GPIO_AF_1) :
                          GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_1, NO_REMAP, GPIO_AF_1);
        }
        else {
            if (remapIdx == 0) {
                GPIOB_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_1, EXTI_MAPR_TIM3_PARTIAL, GPIO_AF_1) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_1, EXTI_MAPR_TIM3_PARTIAL, GPIO_AF_1);
            }
#if defined(GPIOC)            
            if (remapIdx == 1) {
                GPIOC_ClockEnable();
                (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOC, GPIO_Pin_9, EXTI_MAPR_TIM3, GPIO_AF_1) :
                        	  GPIO_Mode_FLOATING_Init(	 GPIOC, GPIO_Pin_9, EXTI_MAPR_TIM3, GPIO_AF_1);
            }
#endif            
        }
        break;
#if defined(TIM4)
        case TIM4_BASE:
        GPIOB_ClockEnable();
        (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_9, NO_REMAP, NO_FUNCAF) :
                	  GPIO_Mode_FLOATING_Init(	 GPIOB, GPIO_Pin_9, NO_REMAP, NO_FUNCAF);
        break;
#endif
#if defined(TIM8)
        case TIM8_BASE:
        if (!remapEn) {
            GPIOC_ClockEnable();
            (inoutMode) ? GPIO_Mode_AF_PP_20MHz_Init(GPIOC, GPIO_Pin_9, NO_REMAP, GPIO_AF_3) :
                          GPIO_Mode_FLOATING_Init(	 GPIOC, GPIO_Pin_9, NO_REMAP, GPIO_AF_3);
        }
        break;
#endif
        default: break;
    }
}
#endif

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer PWM-Mode GPIO Configure
//  @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 14, 16 or 17 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_PWM_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (ch & 0x01)
        BSP_TIM_CH1_GPIO_Configure(tim, remapEn, remapIdx, 1);                         //As output
    if (ch & 0x02)
        BSP_TIM_CH2_GPIO_Configure(tim, remapEn, remapIdx, 1);                         //As output
    if (ch & 0x04)
        BSP_TIM_CH3_GPIO_Configure(tim, remapEn, remapIdx, 1);                         //As output
    if (ch & 0x08)
        BSP_TIM_CH4_GPIO_Configure(tim, remapEn, remapIdx, 1);                         //As output
}

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer CapturePulse-Mode GPIO Configure
//  @param  TIMx: where x can be 1, 2, 3, 4 or 8 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_CapturePulse_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (ch == 0) ch = 0;
    BSP_TIM_CH2_GPIO_Configure(tim, remapEn, remapIdx, 0);
}

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer CapturePWM-Mode GPIO Configure
//  @param  TIMx: where x can be 1, 2, 3, 4 or 8 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_CapturePWM_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (ch == 0) ch = 0;
    BSP_TIM_CH1_GPIO_Configure(tim, remapEn, remapIdx, 0);
}

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer Encoder-Mode GPIO Configure
//  @param  TIMx: where x can be 1, 2, 3, 4 or 8 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_Encoder_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (ch == 0) ch = 0;
    BSP_TIM_CH1_GPIO_Configure(tim, remapEn, remapIdx, 0);
    BSP_TIM_CH2_GPIO_Configure(tim, remapEn, remapIdx, 0);
}

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer OnePulse-Mode GPIO Configure
//  @param  TIMx: where x can be 1, 2, 3, 4 or 8 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_OnePulse_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (ch == 0) ch = 0;
    BSP_TIM_CH1_GPIO_Configure(tim, remapEn, remapIdx, 1);
    //BSP_TIM_CH2_GPIO_Configure(tim, remapEn, remapIdx, 0);
}

////////////////////////////////////////////////////////////////////////////////
//  @brief  Timer 6-step Mode GPIO Configure
//  @param  TIMx: where x can be 1 or 8 to select the TIM peripheral.
//  @param  remapEn:  true or false to select remap function.
//  @param  remapIdx: select Pin remap source.
//  @retval None.
////////////////////////////////////////////////////////////////////////////////
void BSP_TIM_6Step_GPIO_Configure(TIM_TypeDef* tim, u8 ch, bool remapEn, u8 remapIdx)
{
    if (tim == (TIM_TypeDef*)0) tim = (TIM_TypeDef*)0;
    if (ch == 0) ch = 0;
    if (remapEn == false) remapEn = false;
    if (remapIdx == 0) remapIdx = 0;
    
    //Todo: just config TIM1
    GPIOA_ClockEnable();
    GPIOB_ClockEnable();

#if defined(__MM32_MB032) || defined(__MM32_MB033)
    /* TIM1 CH1 ~ CH3 */
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_6,  NO_REMAP, GPIO_AF_1);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_8,  NO_REMAP, GPIO_AF_1);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_10, NO_REMAP, GPIO_AF_1);
    /* TIM1 CH1N ~ CH3N */
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_7,  NO_REMAP, GPIO_AF_1);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_9,  NO_REMAP, GPIO_AF_1);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_0,  NO_REMAP, GPIO_AF_2);
    /* TIM1 Brake input */
    //GPIO_Mode_FLOATING_Init   (GPIOA, GPIO_Pin_4,  NO_REMAP, GPIO_AF_2);
#else
    /* TIM1 CH1 ~ CH3 */
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_8,  NO_REMAP, GPIO_AF_2);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_9,  NO_REMAP, GPIO_AF_2);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOA, GPIO_Pin_10, NO_REMAP, GPIO_AF_2);
    /* TIM1 CH1N ~ CH3N */
    GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_13, NO_REMAP, GPIO_AF_2);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_14, NO_REMAP, GPIO_AF_2);
    GPIO_Mode_AF_PP_20MHz_Init(GPIOB, GPIO_Pin_15, NO_REMAP, GPIO_AF_2);
    /* TIM1 Brake input */
    //GPIO_Mode_FLOATING_Init   (GPIOB, GPIO_Pin_12, NO_REMAP, GPIO_AF_2);
#endif
}

/// @}

/// @}

/// @}
